/**			                                                    
		   ____                    _____ _______ _____       XTARK@塔克创新
		  / __ \                  / ____|__   __|  __ \ 
		 | |  | |_ __   ___ _ __ | |       | |  | |__) |
		 | |  | | '_ \ / _ \ '_ \| |       | |  |  _  / 
		 | |__| | |_) |  __/ | | | |____   | |  | | \ \ 
		  \____/| .__/ \___|_| |_|\_____|  |_|  |_|  \_\
				| |                                     
				|_|                OpenCTR   机器人控制器
									 
  ****************************************************************************** 
  *           
  * 版权所有： XTARK@塔克创新  版权所有，盗版必究
  * 公司网站： www.xtark.cn   www.tarkbot.com
  * 淘宝店铺： https://xtark.taobao.com  
  * 塔克微信： 塔克创新（关注公众号，获取最新更新资讯）
  *      
  ******************************************************************************
  * @作  者  塔克创新团队
  * @内  容  TIM7定时器产生控制周期
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_TIM_H
#define __AX_TIM_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

// 接口函数
void AX_TIM7_Init(uint16_t cnt_us);  //TIM初始化
void AX_TIM7_Cmd(FunctionalState NewState); //TIM定时器开启关闭
uint8_t AX_TIM7_CheckIrqStatus(void);//标志位确认

#endif 

/******************* (C) 版权 2023 XTARK **************************************/
